{
    "inputProductName": "Accelerzyme CPG BF",
    "inputBusinessLine": "FBI",
    "inputListDocumentation": "HIDDEN",
    "inputSecret": "HIDDEN",
    "inputWebSearch": false,
    "inputParallel": true,
    "stg_lsTempFile": "HIDDEN",
    "stg_businessLineStr": "Food & Beverage",
    "stg_hashinputProductName": "ea241bd2e7dee1c1166df60eae5699e87c226322d6cab51e435eeaeb45ca4ae5",
    "stg_hashinputBusinessLine": "c6cd4cf936fd5ad884ed4c278d147982124a6b7df27d95ddf58cd7a60660664c",
    "stg_hashinputListDocumentation": "26e14c12b37edae7bf0658029a96dc9d77fdace16f403ce2633eb4a18ba1a742",
    "stg_hashCombined": "b0eb1859a40a0fe291741494869173079a12d9cd077b98653b4d0b2a6d1a2b55",
    "stg_lsParsedText": "HIDDEN",
    "stg_parsedText": "TEXT_FROM_FILE_NAME:26e14c12b37edae7bf0658029a96dc9d77fdace16f403ce2633eb4a18ba1a742.pdf \n\n\n## Page 1\n\nG\nQuality\nfor Life\nDSM\nBRIGHT SCIENCE. BRIGHTER LIVING.\nProduct Specification Sheet\nACCELERZYME CPG BF\nLast revision:\n18 February 2019\nProduct Information\nDescription\nAccelerzyme® CPG BF is a liquid carboxypeptidase (protease) preparation derived from a\nselected strain of Aspergillus niger.\nAppearance\nGreen (product color may vary from batch to batch)\nClarity\nClear to opalescent\nStatus\n. Kosher approved\n· Halal approved\n. In the producing micro-organism, genes naturally present in the micro-organism have been\noverexpressed using biotechnological techniques. (statement available on request)\n. Suitable for vegans\n· Suitable for vegetarians\nPhysical & Chemical specifications\nProtease activityª\n≥ 900 CPGU/ml\nLead\n≤5ppm\npH\n4.3 - 4.7\nArsenic\n≤ 3 ppm\nGlycerol\n≥ 50 %(w/w)\nMercury\n≤ 0.5 ppm\nHeavy metals (as Pb)\n≤ 30 ppm (as Pb)\nCadmium\n≤ 0.5 ppm\nMicrobiological specifications\nStandard plate count\n≤ 100 CFU/ml\nStaphylococcus aureus\nabsent in 1 ml\nColiforms\n≤ 1 CFU/ml\nEscherichia coli\nabsent in 25 g\nYeasts\n≤ 10 CFU/ml\nListeria monocytogenes\nabsent in 25 g\nMolds\n≤ 10 CFU/ml\nAntimicrobial activity\nabsent by test\nSalmonella\nabsent in 25 g\nMycotoxins\nabsent by test\nComposition\nIngredients\nTypical values\nGlycerol\n54 %\nEnzyme solution\n46 %\nHEALTH . NUTRITION . MATERIALS\nPage 1 of 2\n\n## Page 2\n\nQuality\nfor Life\nDSM\nBRIGHT SCIENCE. BRIGHTER LIVING.\nRegulatory information\nThe products are in compliance with the general specifications for food enzyme preparations regarding heavy metals and\nmicrobiological properties as published in the Food Chemicals Codex and by JECFA. The analytical methods used are derived from\ninternational standardized methods like FCC, ISO or JECFA.\nPackaging & Storage\nPackaging\nStorage conditions\nProduct number 9185: 20 kg\n. The product must be stored in the original sealed containers.\n. Recommended storage temperature 4-8 ℃.\n. When stored in recommended condition, the shelflife is 24 months, and the activity loss will\nbe less than 5% within 12 months.\nSafety & Handling\nPlease refer to the Safety Data Sheet, available on request.\nFootnotes\na 1 CPGU = amount of enzyme needed to decrease the optical density at 340 nm by 1 absorbance unit per minute (1 AU/min) in the\nconditions of the test (hydrolysis of 1.5 mM FA-Phe-Ala pH 4,5 at 37ºC).\nHead Office: A. Fleminglaan 1 | P.O. Box 1 | 2600 MA Delft | The Netherlands | tel. +31 15 279 9111\nFor further information, additional addresses and our webshop visit www.dsm.com/foodandbeverages\nAlthough diligent care has been used to ensure that the information provided herein is accurate, nothing contained herein can be construed to imply any representation or\nwarranty for which we assume legal responsibility, including without limitation any warranties as to the accuracy, currency or completeness of this information or of non-\ninfringement of third party intellectual property rights. The content of this document is subject to change without further notice. This document is non-controlled and will not be\nautomatically replaced when changed. Please contact us for the latest version of this document or for further information. Since the user's product formulations, specific use\napplications and conditions of use are beyond our control, we make no warranty or representation regarding the results which may be obtained by the user. It shall be the\nresponsibility of the user to determine the suitability of our products for the user's specific purposes and the legal status for the user's intended use of our products.\nDSM Food Specialties B.V. | A. Fleminglaan 1 | 2613 AX Delft | The Netherlands | info.food@dsm.com | Trade Register Number 27235314\nHEALTH . NUTRITION . MATERIALS\nPage 2 of 2",
    "stg_lsBase64": "HIDDEN",
    "gpt_manufacturer_or_supplier_answer": "DSM Food Specialties B.V.",
    "gpt_manufacturer_or_supplier_reason": "The product specification sheet for Accelerzyme CPG BF includes contact information and addresses for DSM Food Specialties B.V., indicating they are the manufacturer or supplier. The document header and footer also prominently feature the DSM brand and website (www.dsm.com/foodandbeverages), confirming DSM as the responsible company for this product.",
    "gpt_composition_search_answer": "",
    "gpt_function_search_answer": "",
    "gpt_application_search_answer": "",
    "gpt_combined_web_search": "",
    "gpt_text_of_this_product_only_answer": "HIDDEN",
    "gpt_select_industry_cluster_answer": [
        "Processed Food & Food Service (PFFS)"
    ],
    "gpt_select_industry_cluster_reason": "Selected Processed Food & Food Service (PFFS) because the product is a protease enzyme preparation used in food processing applications, as indicated by its description and compliance with food enzyme preparation standards. There is no specific mention of use in beverage, dairy, confectionery, bakery, or food supplements sectors in the document.",
    "gpt_select_compositions_answer": [
        "Enzymes",
        "Microbial-derived ingredients",
        "Heavy metals",
        "Glycerol"
    ],
    "gpt_select_compositions_reason": "Selected Enzymes because the product is described as a liquid carboxypeptidase (protease) preparation. Selected Microbial-derived ingredients because the enzyme is derived from Aspergillus niger, a microorganism. Selected Heavy metals because the product specification lists limits for heavy metals including lead, arsenic, mercury, and cadmium. Selected Glycerol because glycerol is explicitly listed as a major ingredient (≥50% w/w).",
    "gpt_select_functions_answer": [
        "Food Enzyme",
        "Humectant"
    ],
    "gpt_select_functions_reason": "Selected Food Enzyme because the product is described as a liquid carboxypeptidase (protease) enzyme preparation derived from Aspergillus niger. Selected Humectant because the product contains ≥ 50% glycerol, which is commonly used as a humectant.",
    "gpt_select_applications_answer": [],
    "gpt_select_applications_reason": "No specific application or food product use is mentioned in the document for Accelerzyme CPG BF. The document only describes the enzyme preparation, its composition, specifications, and storage, without linking it to any particular food or beverage application.",
    "gpt_cas_from_doc_answer": "N/A",
    "gpt_cas_from_doc_reason": "The provided product specification sheet for Accelerzyme CPG BF from DSM Food Specialties B.V. does not mention any CAS Registry Number.",
    "gpt_physical_form_answer": "Liquid",
    "gpt_physical_form_reason": "Selected Liquid because the product description states that Accelerzyme CPG BF is a liquid carboxypeptidase preparation and the appearance section describes it as a green liquid with clarity 'Clear to opalescent'.",
    "gpt_gen_product_description": "Accelerzyme CPG BF is a liquid carboxypeptidase enzyme preparation derived from Aspergillus niger, presented as a green, clear to opalescent solution containing over 50% glycerol. It offers high protease activity (≥ 900 CPGU/ml) and is suitable for vegan and vegetarian applications. The product is kosher and halal approved, with strict microbiological and heavy metal controls, making it reliable for food industry use.",
    "gpt_recommended_dosage_answer": "N/A",
    "gpt_recommended_dosage_reason": "No recommended dosage instructions are mentioned in the provided document for Accelerzyme CPG BF from DSM Food Specialties B.V.",
    "gpt_certifications_answer": [
        "ISO",
        "CODEX, JECFA",
        "HALAL, JAKIM, MUI",
        "Kosher",
        "Vegan"
    ],
    "gpt_certifications_reason": "Selected ISO because the document states analytical methods are derived from international standardized methods like ISO. Selected CODEX, JECFA because the product complies with general specifications published in the Food Chemicals Codex and by JECFA. Selected HALAL, JAKIM, MUI because the product is explicitly stated as Halal approved. Selected Kosher because the product is explicitly stated as Kosher approved. Selected Vegan because the product is explicitly stated as suitable for vegans.",
    "gpt_claims_answer": [
        "Bio-Fermentation"
    ],
    "gpt_claims_reason": "Selected Bio-Fermentation because the product is derived from a selected strain of Aspergillus niger, indicating a fermentation-based production process. No mention of meat & dairy alternative, natural & ethically sourced claims, resource & energy optimization, sustainable food waste reduction, or upcycling in the document.",
    "gpt_health_benefits_answer": [],
    "gpt_health_benefits_reason": "No applicable health benefits because product functions not in the required list (Dietary Fiber, Food Culture, Fortification/Nutraceutical, Probiotic/Postbiotic, Protein)",
    "time_start": "2026-01-15 16:54:50.451853",
    "time_end": "2026-01-15 16:55:20.998400",
    "time_duration": "30.546547"
}